app/Controllers/DashboardAdmin.php

SELECT COUNT(*) AS `numrows` FROM `pelanggan`
SELECT *
FROM `pelanggan`
---
    public function index(): string
    {
        try {
            // Load model 'PelangganAllModel'
            $pelangganModel = new PelangganAllModel();

            // Menghitung jumlah total data di tabel 'pelanggan'
            $totalData = $pelangganModel->countAll();

            // Menampilkan total data
            $data['totalDataPelanggan'] = $totalData;

            // Mengambil data total harga keseluruhan dari tabel 'pelanggan'
            $dataPelanggan = $pelangganModel->findAll();