app/Controllers/TableDynamics.php

SELECT *
FROM `pelanggan`
---
    public function index()
    {
        try {
            // Load model 'PelangganModel'
            $pelangganModel = new PelangganAllModel();

            // Mengambil data pelanggan
            $data['pelanggan'] = $pelangganModel->findAll();