app/Controllers/ValidationForm.php

SELECT *
FROM `pelanggan`
---
    public function index()
    {
        // Load model 'PelangganAllModel'
        $pelangganModel = new PelangganAllModel();

        // Ambil data pelanggan dari model
        $data['pelanggan'] = $pelangganModel->findAll();

SELECT *
FROM `pelanggan`
WHERE `nama` = 'hanin'
 LIMIT 1
---
    public function processlayanan()
{
    // Menerima data dari permintaan POST
    $data = $this->request->getPost();

    // Validasi data jika diperlukan
    // Misalnya:
    // $validation = \Config\Services::validation();
    // $validation->setRules([...]);
    // if (!$validation->run($data)) {
    //     return $this->response->setStatusCode(400)->setJSON($validation->getErrors());
    // }

    // Ambil data pelanggan yang sesuai dengan nama yang diberikan
    $namaPelanggan = $data['nama']; // Asumsikan 'nama' adalah nama pelanggan yang dipilih
    $pelangganModel = new PelangganAllModel();
    $pelanggan = $pelangganModel->where('nama', $namaPelanggan)->first();

SELECT *
FROM `pelanggan`
---
    }

    // Ambil data pelanggan dari model
    $data['pelanggan'] = $pelangganModel->findAll();